TP1NavarroMilagros/app/Controllers/carrito_controller.php

SELECT *
FROM `productos`
ORDER BY `id` DESC
---
	public function catalogo(){
		$session =session();
		$dato= array('titulo'=>'todos los productos');
		$productoModel = new Producto_Model();
		$data['producto']=$productoModel->orderBy('id','Desc')->findAll();