TP1NavarroMilagros/app/Controllers/consulta_controller.php

SELECT *
FROM `consultas`
ORDER BY `id` ASC
---
    public function ver_consulta(){
        $consulta_model = new Consulta_model();
        $data['titulo'] = 'Consultas';

        $datos['consultas'] = $consulta_model->orderBy('id','asc')->findAll();