TP1NavarroMilagros/app/Controllers/Productocontroller.php

	public function index(){
		$productoModel = new Producto_Model();
		$data['producto']=$productoModel ->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `productos`
ORDER BY `id` DESC