TP1NavarroMilagros/app/Controllers/venta_controller.php

SELECT `u`.`id_cabeza`, `u`.`total_venta`, `u`.`fecha`
FROM `ventas_cabecera` `u`
JOIN `usuarios` `d` ON `u`.`usuario_id` = `d`.`id`
WHERE `usuario_id` = '14'
---
    public function micompra($id){
        //Me conecto a la base de datos
        $db = db_connect();
        //Me ubico en la tabla ventas_cabecera y genero un alias "u" y guardo su contenido en $bluider
        $builder = $db->table('ventas_cabecera u');

        //Filtro las ventas para que solo rescate las ventas de este Cliente mediante su id.
        $builder->where('usuario_id',$id);
        //Selecciono de ambas tablas (Cabecera y Detalle) los campos que necesito mostrar en la vista
        $builder->select('u.id_cabeza , u.total_venta , u.fecha');

        //Con un Join relaciono los "id" de ambas tablas para generar una sola con todos los datos
        $builder->join('usuarios d','u.usuario_id = d.id');



        //Guardo el contenido de la relacion de ambas tablas en la variable $ventas
        $ventas= $builder->get();

SELECT `u`.`venta_id`, `u`.`producto_id`, `u`.`cantidad`, `u`.`precio`, `u`.`total`
FROM `ventas_detalle` `u`
---
public function ver_ventas(){

    $session= session();

   $id=$session->get('id');

        $db = db_connect();
        //Me ubico en la tabla ventas_cabecera y genero un alias "u" y guardo su contenido en $bluider
        $builder = $db->table('ventas_detalle u');

        //Filtro las ventas para que solo rescate las ventas de este Cliente mediante su id.

        //Selecciono de ambas tablas (Cabecera y Detalle) los campos que necesito mostrar en la vista
        $builder->select('u.venta_id, u.producto_id , u.cantidad ,u.precio, u.total');

        //Con un Join relaciono los "id" de ambas tablas para generar una sola con todos los datos




        //Guardo el contenido de la relacion de ambas tablas en la variable $ventas
        $ventas= $builder->get();